---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.Erase(Autodesk.Revit.DB.PlanCircuit)
source: html/fc656f1a-7155-b96a-9482-0cbee29495b3.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.Erase Method

Removes a specified object from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	PlanCircuit item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PlanCircuit`) - The item to be erased.

## Returns
The number of items that were erased from the set.